Coverting the acsii diagrams to mermaid diagrams
Also adding a github actions to make sure mermaid diagrams are not broken

Signed-off-by: Lalatendu Mohanty <lmohanty@redhat.com>
